# Заготовки названий для рекомендаций
titles_translation = {
    'national': 'Отечественная',
    'eastern': 'Восточная',
    'magic': 'Сказочная',
    'christmas': 'Рождественская',
    'hanging': 'Подвесная',
    'crown': 'Навершие',
    'gift': 'Подарок',
    'garland': 'Гирлянда',
}

# Заготовки сообщений для рекомендаций
anti_povtoritel_definitely = 'Однозначно пора использовать антиповторитель!'
anti_povtoritel_maybe = (
    'Чисто математически еще рано использовать антиповторитель. '
    'Но, кажется уже лучше подстраховаться и крафтить с ним.'
)
congratulations = 'Все выбранные альбомы 5 лвл. собраны. Поздравляю!'
all_random_definitely = (
    'Выгоднее крафтить в случайной коллекции и случайной категории. '
    'Это может занять больше попыток, но все-равно ожидаемая трата '
    'осколков будет меньше. Не забывайте разбивать ненужные игрушки.'
)
all_random_maybe = (
    'Чисто математически выгоднее крафтить в случайной коллекции и случайной '
    'категории. Это может занять больше попыток, но все-равно ожидаемая трата '
    'осколков меньше. Как вариант, можно воспользоваться советом ниже. '
    'Может потратится больше осколков, но попыток будет меньше.'
)
all_random_better_next = (
    'Чисто математически выгоднее крафтить в случайной коллекции и случайной '
    'категории. Хотя, лучше воспользоваться советом ниже. '
    'Может потратится больше осколков (а может и нет), '
    'но точно с первой попытки.'
)
collect_definitely = "Выгоднее крафтить в коллекциях: "
collect_maybe = "Можно также крафтить в коллекциях: "
category_definitely = "Выгоднее крафтить в категориях: "
category_maybe = "Можно также крафтить в категориях: "
collect_category = "Можно крафтить в следующих категориях и коллекциях: "
