TOTAL_TOYS = 92  # Общее количество игрушек во всех коллекциях
COLLECTIONS_NUM = 4  # Количество коллекций
MAX_TOYS_IN_COLLECTION = 23  # Количество игрушек в одной коллекции
# Максимальные количество игрушек в каждой категории
MAX_HANGING = 7  # Подвесные игрушки
MAX_CROWN = 4  # Навершия
MAX_GIFT = 6  # Подарки
MAX_GARLAND = 6  # Гирлянды

ONE_TOY_FRAGMENTS = 250  # Количество осколков с одной игрушки

ALL_RANDOM_CRAFT = 360  # Количество осколков на крафт случайной игрушки
HALF_SPECIFIC_CRAFT = 720  # Количество осколков на крафт игрушки
# в случайной коллекции или в случайной катекории
ALL_SPECIFIC_CRAFT = 1080  # Количество осколков на крафт определенной игрушки
ANTIPOVTORITEL_CRAFT = 2080  # Количество осколков на крафт с антиповторителем

UNCERT_COEF = 0.7  # Коэффициент неопределенности. Обозначает при какой разнице
# значений можно рассмотреть и другой вариант

# Полная коллекция альбомов
FULL_COLLECTION_DATA = {
    'hanging': MAX_HANGING,
    'crown': MAX_CROWN,
    'gift': MAX_GIFT,
    'garland': MAX_GARLAND
}
